; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem satellite-57)
 (:domain satellite)
 (:objects 
    sat1 sat2 sat3 sat4 sat5 sat6 sat7 - satellite
    ins1 ins2 ins3 ins4 ins5 ins6 ins7 ins8 ins9 ins10 ins11 ins12 - instrument
    mod1 mod2 - mode
    dir1 dir2 dir3 dir4 dir5 dir6 dir7 - direction
    )
 (:init 
    (pointing sat1 dir2)
    (pointing sat2 dir6)
    (pointing sat3 dir1)
    (pointing sat4 dir4)
    (pointing sat5 dir6)
    (pointing sat6 dir5)
    (pointing sat7 dir5)
    (power_avail sat1)
    (power_avail sat2)
    (power_avail sat3)
    (power_avail sat4)
    (power_avail sat5)
    (power_avail sat6)
    (power_avail sat7)
    (calibration_target ins1 dir3)
    (calibration_target ins2 dir6)
    (calibration_target ins3 dir3)
    (calibration_target ins4 dir7)
    (calibration_target ins5 dir4)
    (calibration_target ins6 dir5)
    (calibration_target ins7 dir7)
    (calibration_target ins8 dir3)
    (calibration_target ins9 dir3)
    (calibration_target ins10 dir4)
    (calibration_target ins11 dir3)
    (calibration_target ins12 dir3)
    (on_board ins1 sat4)
    (on_board ins2 sat6)
    (on_board ins3 sat3)
    (on_board ins4 sat7)
    (on_board ins5 sat2)
    (on_board ins6 sat5)
    (on_board ins7 sat1)
    (on_board ins8 sat3)
    (on_board ins9 sat4)
    (on_board ins10 sat7)
    (on_board ins11 sat1)
    (on_board ins12 sat2)
    (supports ins10 mod2)
    (supports ins7 mod2)
    (supports ins11 mod2)
    (supports ins3 mod1)
    (supports ins5 mod1)
    (supports ins8 mod2)
    (supports ins4 mod2)
    (supports ins10 mod1)
    (supports ins6 mod1)
    (supports ins4 mod1)
    (supports ins6 mod2)
    (supports ins11 mod1)
    (supports ins12 mod2)
    (supports ins7 mod1)
    (supports ins8 mod1)
    (supports ins5 mod2)
    (supports ins12 mod1)
    (supports ins2 mod2)
    (supports ins1 mod1)
    (supports ins2 mod1)
    (supports ins1 mod2)
    (supports ins3 mod2)
    (supports ins9 mod1))
 (:goal (and 
(have_image dir1 mod1)
(have_image dir1 mod2)
(have_image dir2 mod1)
(have_image dir2 mod2)
(have_image dir3 mod1)
(have_image dir6 mod2)
))
)

; plan
1. (switch_on ins3 sat3)
   deleted: (power_avail sat3)
   added: (power_on ins3)
   goals met: 0 of 6
2. (turn_to sat3 dir3 dir1)
   deleted: (pointing sat3 dir1)
   added: (pointing sat3 dir3)
   goals met: 0 of 6
3. (calibrate sat3 ins3 dir3)
   added: (calibrated ins3)
   goals met: 0 of 6
4. (take_image sat3 dir3 ins3 mod1)
   added: (have_image dir3 mod1)
   goals met: 1 of 6
5. (turn_to sat3 dir1 dir3)
   deleted: (pointing sat3 dir3)
   added: (pointing sat3 dir1)
   goals met: 1 of 6
6. (take_image sat3 dir1 ins3 mod1)
   added: (have_image dir1 mod1)
   goals met: 2 of 6
7. (take_image sat3 dir1 ins3 mod2)
   added: (have_image dir1 mod2)
   goals met: 3 of 6
8. (turn_to sat3 dir2 dir1)
   deleted: (pointing sat3 dir1)
   added: (pointing sat3 dir2)
   goals met: 3 of 6
9. (take_image sat3 dir2 ins3 mod1)
   added: (have_image dir2 mod1)
   goals met: 4 of 6
10. (take_image sat3 dir2 ins3 mod2)
   added: (have_image dir2 mod2)
   goals met: 5 of 6
11. (turn_to sat3 dir6 dir2)
   deleted: (pointing sat3 dir2)
   added: (pointing sat3 dir6)
   goals met: 5 of 6
12. (take_image sat3 dir6 ins3 mod2)
   added: (have_image dir6 mod2)
   goals met: 6 of 6
